pmo-dataset/variations/graphviz_with_ids/55.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Prepare implements"];
  "Task_2" [label="Hand washing"];
  "Task_3" [label="Get in sterile\nclothes"];
  "Task_4" [label="Clean puncture area"];
  "Task_5" [label="Drap puncture zone"];
  "Task_6" [label="Ultrasound\nconfiguration"];
  "Task_7" [label="Gel in probe"];
  "Task_8" [label="Cover probe"];
  "Task_9" [label="Put sterile gel"];
  "Task_10" [label="Position probe"];
  "Task_11" [label="Position patient"];
  "Task_12" [label="Doppler\nidentification"];
  "Task_13" [label="Anatomic\nidentification"];
  "Task_14" [label="Compression\nidentification"];
  "Task_15" [label="Anesthetize patient"];
  "Task_16" [label="Puncture patient"];
  "Task_17" [label="Check blood return"];
  "Task_18" [label="Drop probe"];
  "Task_19" [label="Remove syringe"];
  "Task_20" [label="Guidewire install"];
  "Task_21" [label="Remove trocar"];
  "Task_22" [label="Check wire in long\naxis"];
  "Task_23" [label="Check wire in short\naxis"];
  "Task_24" [label="Check wire position"];
  "Task_25" [label="Widen pathway"];
  "Task_26" [label="Advance catheter"];
  "Task_27" [label="Remove guidewire"];
  "Task_28" [label="Check flow and\nreflow"];
  "Task_29" [label="Check catheter\nposition"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="Vein identification\nmethod"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="Blood return correct\n?"];
  "ExclusiveGateway_7" [shape=diamond, label="Wire in good\nposition ?"];

  "StartNoneEvent_1" -> "Task_1";
  "Task_1" -> "Task_2";
  "Task_2" -> "Task_3";
  "Task_3" -> "Task_4";
  "Task_4" -> "Task_5";
  "Task_5" -> "Task_6";
  "Task_6" -> "Task_7";
  "Task_7" -> "Task_8";
  "Task_8" -> "Task_9";
  "Task_9" -> "Task_10";
  "Task_10" -> "Task_11";
  "Task_11" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Task_12";
  "ExclusiveGateway_1" -> "Task_13";
  "ExclusiveGateway_1" -> "Task_14";
  "Task_12" -> "ExclusiveGateway_2";
  "Task_13" -> "ExclusiveGateway_2";
  "Task_14" -> "ExclusiveGateway_2";
  "Task_15" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Task_16";
  "Task_16" -> "Task_17";
  "ExclusiveGateway_2" -> "Task_15";
  "Task_18" -> "Task_19";
  "Task_19" -> "Task_20";
  "Task_20" -> "Task_21";
  "Task_21" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Task_22";
  "ExclusiveGateway_4" -> "Task_23";
  "Task_22" -> "ExclusiveGateway_5";
  "Task_23" -> "ExclusiveGateway_5";
  "ExclusiveGateway_5" -> "Task_24";
  "Task_17" -> "ExclusiveGateway_6";
  "Task_24" -> "ExclusiveGateway_7";
  "ExclusiveGateway_6" -> "ExclusiveGateway_3" [label="No"];
  "ExclusiveGateway_7" -> "ExclusiveGateway_3" [label="No"];
  "ExclusiveGateway_6" -> "Task_18" [label="Yes"];
  "ExclusiveGateway_7" -> "Task_25" [label="Yes"];
  "Task_25" -> "Task_26";
  "Task_26" -> "Task_27";
  "Task_27" -> "Task_28";
  "Task_28" -> "Task_29";
  "Task_29" -> "EndNoneEvent_1";
}
