pmo-dataset/variations/mermaid_basic/55.mmd
graph LR
	StartEvent_1((" ")) --> Task_1["Prepare implements"]
	Task_1 --> Task_2["Hand washing"]
	Task_2 --> Task_3["Get in sterile clothes"]
	Task_3 --> Task_4["Clean puncture area"]
	Task_4 --> Task_5["Drap puncture zone"]
	Task_5 --> Task_6["Ultrasound configuration"]
	Task_6 --> Task_7["Gel in probe"]
	Task_7 --> Task_8["Cover probe"]
	Task_8 --> Task_9["Put sterile gel"]
	Task_9 --> Task_10["Position probe"]
	Task_10 --> Task_11["Position patient"]
	Task_11 --> ExclusiveGateway_1{"Vein identification method"}
	ExclusiveGateway_1 --> Task_12["Doppler identification"]
	ExclusiveGateway_1 --> Task_13["Anatomic identification"]
	ExclusiveGateway_1 --> Task_14["Compression identification"]
	Task_12 --> ExclusiveGateway_2{"X"}
	Task_13 --> ExclusiveGateway_2
	Task_14 --> ExclusiveGateway_2
	Task_15["Anesthetize patient"] --> ExclusiveGateway_3{"X"}
	ExclusiveGateway_3 --> Task_16["Puncture patient"]
	Task_16 --> Task_17["Check blood return"]
	ExclusiveGateway_2 --> Task_15
	Task_18["Drop probe"] --> Task_19["Remove syringe"]
	Task_19 --> Task_20["Guidewire install"]
	Task_20 --> Task_21["Remove trocar"]
	Task_21 --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_4 --> Task_22["Check wire in long axis"]
	ExclusiveGateway_4 --> Task_23["Check wire in short axis"]
	Task_22 --> ExclusiveGateway_5{"X"}
	Task_23 --> ExclusiveGateway_5
	ExclusiveGateway_5 --> Task_24["Check wire position"]
	Task_17 --> ExclusiveGateway_6{"Blood return correct ?"}
	Task_24 --> ExclusiveGateway_7{"Wire in good position ?"}
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_3
	ExclusiveGateway_7 -->|"No"| ExclusiveGateway_3
	ExclusiveGateway_6 -->|"Yes"| Task_18
	ExclusiveGateway_7 -->|"Yes"| Task_25["Widen pathway"]
	Task_25 --> Task_26["Advance catheter"]
	Task_26 --> Task_27["Remove guidewire"]
	Task_27 --> Task_28["Check flow and reflow"]
	Task_28 --> Task_29["Check catheter position"]
	Task_29 --> EndEvent_1((" "))
